#include "includes.h"

void menufor3task(int choose)
{
	switch (choose)
	{
	case 1:
		cout << "Выберите операцию на шине:\n____________________________\n1-Чтение из памяти\n2-Запись в память\n3-Чтение с УВВ\n4-Запись в УВВ\n";
		break;
	case 2:
		cout << "Выберите разрядность адреса:\n____________________________\n1-32 бита\n2-64 бита\n";
		break;
	case 3:
		cout << "Выберите разрядность, передаваемого по шине слова:\n__________________________________________\n1-64 бита\n2-32 бита\n3-16 бит\n4-8 бит\n";
		break;
	case 4:
		cout << "Выберите Время доступа к информации:\n_________________________________\n1. 30 нс\n2. 70 нс\n3. 100 нс\n4. 200 нс\n5. 5-3-1-1-1 25нс\n6. 3-1-1-1 25нс\n7. 4-1-4-1 20 нс\n8. 5-2-2-2 20нс\n9. 3-2-2-2 15нс\n";
		break;
	}
}